// Задача 1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
int a = -9;
int b = -3;
if (a>b)
{
    Console.Write("Max = ");
    Console.WriteLine(a);
}
else 
{
    Console.Write("Max = ");
    Console.WriteLine(b);
}