// Задача 3: Запишите программу, которая на вход принимает число и выдаёт, является ли число чётным.
int a = -3;
if (a % 2 == 0) Console.Write("Да");
else Console.Write("Нет");
